mengiy/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_uart/main.c
/*
 * Configure all peripherals used in this example.
*/
static void crystal_16m_init(void)
{
  NRF_RNG->TASKS_START = 1;
  
  /* Start 16 MHz crystal oscillator */
  NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
  NRF_CLOCK->TASKS_HFCLKSTART = 1;

  /* Wait for the external oscillator to start up */
  while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) 
  {
  }  
}

static void radio_disable(void)
{
  NRF_RADIO->SHORTS = 0;
  NRF_RADIO->EVENTS_DISABLED = 0;
  NRF_RADIO->TEST = 0;
  NRF_RADIO->TASKS_DISABLE = 1;
  while (NRF_RADIO->EVENTS_DISABLED == 0)
  {
  }
  NRF_RADIO->EVENTS_DISABLED = 0;
}

/*
 * Turn on TX carrier test mode
*/
void radio_tx_carrier(uint8_t txpower, uint8_t mode, uint8_t channel)
{
  radio_disable();
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk;
  NRF_RADIO->TXPOWER = (txpower << RADIO_TXPOWER_TXPOWER_Pos);
  NRF_RADIO->MODE = (mode << RADIO_MODE_MODE_Pos);
  NRF_RADIO->FREQUENCY = channel;
  NRF_RADIO->TEST = (RADIO_TEST_CONST_CARRIER_Enabled << RADIO_TEST_CONST_CARRIER_Pos) | (RADIO_TEST_PLL_LOCK_Enabled << RADIO_TEST_PLL_LOCK_Pos);
  NRF_RADIO->TASKS_TXEN = 1;
}

/**@brief Application main function.
 */
#if 0
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    //buttons_leds_init(&erase_bonds);
    //ble_stack_init();
    //gap_params_init();
    //services_init();
    //advertising_init();
    //conn_params_init();

    printf("\r\nUART Start!\r\n");
    //err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    //APP_ERROR_CHECK(err_code);

    app_timer_create(&simple_timer_id, APP_TIMER_MODE_REPEATED, simple_timer_timeout_handler);
    app_timer_start(simple_timer_id, APP_TIMER_TICKS(500,APP_TIMER_PRESCALER), NULL);
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}
#endif

#if 0
int main(void)
{
	clocks_start();

	APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	uart_init();
	app_timer_create(&simple_timer_id, APP_TIMER_MODE_REPEATED, simple_timer_timeout_handler);
    app_timer_start(simple_timer_id, APP_TIMER_TICKS(500,APP_TIMER_PRESCALER), NULL);
	
//	NRF_POWER->RAMON = POWER_RAMON_ONRAM0_RAM0On   << POWER_RAMON_ONRAM0_Pos
//                     | POWER_RAMON_ONRAM1_RAM1On   << POWER_RAMON_ONRAM1_Pos
//                     | POWER_RAMON_OFFRAM0_RAM0Off << POWER_RAMON_OFFRAM0_Pos
//                     | POWER_RAMON_OFFRAM1_RAM1Off << POWER_RAMON_OFFRAM1_Pos;
// 
//	NRF_POWER->SYSTEMOFF = 1;
	
	for(;;)
	{
	}
}
#endif

#if 0
int main(void)
{
	crystal_16m_init();
	clocks_start();
	
	radio_tx_carrier(RADIO_TXPOWER_TXPOWER_0dBm, RADIO_MODE_MODE_Nrf_1Mbit, 0);
	
	APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	uart_init();
	app_timer_create(&simple_timer_id, APP_TIMER_MODE_REPEATED, simple_timer_timeout_handler);
    app_timer_start(simple_timer_id, APP_TIMER_TICKS(500,APP_TIMER_PRESCALER), NULL);
	
	while(1);
}
#endif

static void flash_word_read(uint32_t * page_address, uint32_t * p_out_array, uint32_t p_word_count)
{
    // Turn on flash write enable and wait until the NVMC is ready:
    NRF_NVMC->CONFIG = (NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos);

    while (NRF_NVMC->READY == NVMC_READY_READY_Busy)
    {
        // Do nothing.
    }

    memcpy(p_out_array, page_address, (p_word_count << 2));

    while (NRF_NVMC->READY == NVMC_READY_READY_Busy)
    {
        // Do nothing.
    }
}

#if 1
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    uint32_t array;

    flash_word_read((uint32_t *)0x1b000, &array, 1);
    nrf_gpio_cfg_output(17);
    nrf_gpio_pin_toggle(17);

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

//    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

//    printf("\r\nUART Start!\r\n");
//    printf("array=0x%08x\r\n", array);
//    printf("flash page size:0x%x\r\n", (uint16_t)NRF_FICR->CODEPAGESIZE);
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    app_timer_create(&simple_timer_id, APP_TIMER_MODE_REPEATED, simple_timer_timeout_handler);
    app_timer_start(simple_timer_id, APP_TIMER_TICKS(100,APP_TIMER_PRESCALER), NULL);

    // Enter main loop.
    nrf_gpio_pin_toggle(17);
    for (;;)
    {
        power_manage();
    }
}
#endif

#if 0
int main(void)
{
    uint32_t array;

    flash_word_read((uint32_t *)0x1b000, &array, 1);
    nrf_gpio_cfg_output(17);
    nrf_gpio_pin_toggle(17);
    uart_init();
    printf("array=%x\r\n", array);

    while(true)
    {
        nrf_delay_ms(500);
        nrf_gpio_pin_toggle(17);
    }
}
#endif
/**
 * @}
 */
